#include <iostream>
using namespace std;
int main() {
	//If1. ƒано целое число. ≈сли оно €вл€етс€ положительным, то 
	//прибавить к нему 1; в противном случае не измен€ть его.	//¬ывести полученное число.
	/*
	int a;
	cin >> a;
	if (a > 0) {//true
		a += 1;
	}
	cout << a << endl;
	*/
	//If2.ƒано целое число.≈сли оно €вл€етс€ положительным, то 
	//прибавить к нему 1; в противном случае вычесть из него 2. 
	//¬ывести полученное число.
	/*int a;
	cin >> a;
	if (a > 0) {//true
		a += 1;
	}
	else {
		a -= 2;// a = a - 2;
	}
	cout << a << endl;*/
	//If3.ƒано целое число.≈сли оно €вл€етс€ положительным, то 
	//прибавить к нему 1; если отрицательным, то вычесть из него 2; 
	//если нулевым, то
	//заменить его на 10. ¬ывести полученное число.
	/*int a;
	cin >> a;
	if (a > 0) {
		a += 1;
	}
	else if (a < 0) {
		a -= 2;
	}
	else if (a == 0) {
		a = 10;
	}
	cout << a << endl;
	*/
	//If4.ƒаны три целых числа.Ќайти количество положительных чисел в 
	//исходном наборе.
	/*int a, b, c;
	int k = 0;
	cin >> a >> b >> c;
	if (a > 0) { 
		k++; 
	}
	if (b > 0) {
		k++;
	}
	if (c > 0) {
		k++;
	}
	cout << k << endl;*/
	//If6. ƒаны два числа. ¬ывести большее из них.	/*int a, b;
	cin >> a >> b;
	if (a > b) {
		cout << a << endl;
	}
	else if (b > a) {
		cout << b << endl;
	}
	else if (a == b) {
		cout << "equals" << endl;
	}*/
}
