#include <iostream>
using namespace std;
int main() {
	/*Организовать беспрерывный ввод чисел с клавиатуры, пока пользователь не введёт 0. После ввода нуля, показать на экран количество чисел, которые были введены, их общую сумму и среднее арифметическое.Подсказка: необходимо объявить переменную - счетчик, которая будет считать количество введенных чисел, и переменную, которая будет накапливать общую сумму чисел.*/
	/*int k = 0, s = 0, x;
	double sr;
	do {
		cin >> x;
		k++;
		s += x;
	} while (x != 0);
	cout << "sum=" << s << endl;
	cout << "k=" << k << endl;
	sr = (double)s / k;
	cout << "sr=" << sr << endl;*/
	//Необходимо суммировать все нечётные целые числа в диапазоне, который введёт пользователь с клавиатуры.
	/*int a, b, i, sum = 0;
	cin >> a >> b;
	i = a;
	do {
		if (i % 2 != 0) {
			sum += i;
		}
		i += 1;
	} while (i <= b);*/
	/*
	3. Задача посложней. Нарисовать равнобедренный треугольник из символов ^. Высоту выбирает пользователь. Например: высота = 3, на экране
	     /\
	   /\/\/\
	 /\/\/\/\/\
	*/
}