#include <iostream>
using namespace std;
int main() {
	//Дан массив из 5 элементов. Вывести элементы в обратном порядке, от элемента с номером 4 до элемента с номером 0.
	/*const int n = 5;
	int mas[n];
	//ввод массива
	for (int i = 0; i < n; i++) {
		cin >> mas[i];
	}
	//вывод в обратном порядке
	for (int i = n - 1; i >= 0; i--) {
		cout << mas[i]<< ' ';
	}
	cout << endl;*/
	//Дан массив из 15 элементов. Заполнить его случаными числами из диапазона 0-20. Подсчитать кол-во четных чисел в массиве
	/*const int n = 15;
	int arr[n];
	//заполнение и вывод массива
	for (int i = 0; i < n; i++) {
		arr[i] = rand()%21;
		cout << arr[i] << " ";
	}
	cout << endl;
	//подсчет кол-ва четных
	int kol_vo = 0;
	for (int i = 0; i < n; i++) {
		if (arr[i] % 2 == 0) {
			kol_vo++;
		}
	}
	//выводим результат
	cout << kol_vo << endl;*/
	//1 Дан массив из 15 элементов.Заполнить его случайными числами из диапазона 0 - 20. Подсчитать кол-во чисел в массиве, которые не делятся на 5

	//2 Дан массив из 20 элементов.Заполнить его случайными числами из диапазона 0 - 30. Подсчитать сумму тех чисел в массиве, которые делятся на 3 И на 5

	//3 Дан массив из 17 элементов. Заполнить его случайными числами из диапазона 0 - 45. Подсчитать произведение тех чисел в массиве, которые делятся на 2 ИЛИ на 3

	//4 Дан массив из 17 элементов. Заполнить его случайными числами из диапазона 0 - 52. Подсчитать среднее арифметическое элементов С ЧЕТНЫМИ НОМЕРАМИ (0, 2, 4 и т.д.)

	//5 Дан массив из 25 элементов. Заполнить его случайными числами из диапазона 0 - 66. Подсчитать среднее геометрическое (квадратный корень из произведения) элементов С НЕЧЕТНЫМИ НОМЕРАМИ (1, 3, 5 и т.д.) 

}