#include <iostream>
using namespace std;
int main() {
	/*const int size = 5;
	int mas[size];//описание массива из 5 целых чисел
	int mas1[] = {1, 2, 3, 4, 5};//инициализация массива
	//ввод элементов массива с клавиатуры
	for (int i = 0; i < size; i++) {
		cin >> mas[i];
	}
	//вывод элементов массива в строку
	for (int i = 0; i < size; i++) {
		cout << mas[i]<<' ';
	}
	cout << endl;*/
	//Дан массив из 10 элементов. Найти кол-во четных и количество нечетных элементов в этом массиве.
	/*const int size = 10;
	int arr[size];
	//ввод массива
	for (int i = 0; i < size; i++) {
		cin >> arr[i];
	}
	//обработка массива
	int even_qty = 0, odd_qty = 0;
	for (int i = 0; i < size; i++) {
		if (arr[i] % 2 == 0) {
			even_qty++;
		}
		else {
			odd_qty++;
		}
	}
	//вывод результатов
	cout << " even = " << even_qty << endl;
	cout << " odd = " << odd_qty << endl;*/
	//Дан массив из 8 элементов. Найти сумму положительных элементов в этом массиве.
	/*const int size = 8;
	int arr[size];
	//ввод массива
	for (int i = 0; i < size; i++) {
		cin >> arr[i];
	}
	//обработка массива
	int sum = 0;
	for (int i = 0; i < size; i++) {
		if (arr[i] > 0) {
			sum += arr[i];
		}
	}
	//вывод результатов
	cout << sum;*/
	//Дан массив из 11 элементов.Найти средее арифметическое элементов массива.
	//Дан массив из 6 элементов. Найти произведение отрицательных элеметов.
	//Дан массив из 7 элементов. Найти количество элементов, которе не делятся на 2 и на 3.
}