#include <iostream>
using namespace std;
int main() {
	//Дано целое число n. Вывести n раз символ @
	/*int n;
	cin >> n;
	for (int i = 1; i <= n; i += 1) {
		cout << '@';
	}*/
	//Дано два числа x и y (вводим x < y). Найти сумму четных
	//чисел из диапазона x-y.
	/*int x, y, i, sum = 0;
	cout << "Vvedite x: ";
	cin >> x;
	cout << "Vvedite y: ";
	cin >> y;
	i = x;
	while (i <= y) {
		if (i % 2 == 0) {
			sum += i;
		}
		i++;
	}
	cout << sum << endl;*/
	//Дано два числа x и y (вводим x < y). Напечатать
	// нечетные числа из диапазона x-y В ПОРЯДКЕ УБЫВАНИЯ

	//Напечатать прямоугольник 20х8 из символов #
	/*for (int i = 0; i < 20; i++) cout << '#';
	cout << endl;
	for (int i = 0; i < 6; i++)
	{
		cout << '#';
		for (int j = 0; j < 18; j++) cout << ' ';
		cout << '#' << endl;
	}
	for (int i = 0; i < 20; i++) cout << '#';
	cout << endl;*/
	
	//While Дано целое положительное число n. Найти произведение
	//чисел не больших n, которые делятся на 3.

	//For 18. Задано натуральное число N. Найти количество
	//натуральных чисел, не превосходящих N и не делящихся
	//ни на одно из чисел 2,3,5.

	//While 22. дано натуральное n. 
	//вычислить: 1 + 1/2 + 1/3 + 1/4 + ... + 1/n.

	
}